trade_exp/src/Documents/ЧекККМВозврат/ЧекККМВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловКВозврату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6efd4c0-aadb-4fbc-bab2-5bb6f02a424f">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="017fb748-2a94-46b5-a01d-8eaba05eaa20">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60dd2802-f9c1-435e-923c-d459e0c47112">
    <name>ДатаПоследнегоОткрытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8c72a24-a385-45d4-9b74-f0036e4d090c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2838228-73ec-4d7e-9180-86f69e84dd8e">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d5501ee7-ab3c-46cd-b2a5-2895d1a748a2">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37bb3306-a9d4-4d76-ab58-8b95bdb8edf4">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fa59b5-6609-46c8-8c2e-e86b95d64bed">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="285439ea-2699-4a2a-b693-b5ca7dcf27c1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОплатаОтменена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>6</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>22</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8cd09e10-4636-4941-882a-e1d11a583f37">
  <name>ФормыОплаты</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Наличная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
  <enumValues extendedConfigurationObject="551e55ef-70ce-48b5-bd48-20a0855bac13">
    <name>ПодарочныйСертификат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="09285a09-9587-4f41-933d-ff6223c6983f">
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыПлатежнойСистемыККТ/ТипыПлатежнойСистемыККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17d6d642-f9f4-4184-9494-c31448761a97">
  <name>ТипыПлатежнойСистемыККТ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="fc13509e-eb4f-4d15-beb7-65b67ba34e89">
    <name>ПлатежнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e225080a-7355-4bd6-93f0-9701a233c00a">
    <name>СертификатНСПК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="058b36d9-0f38-4998-bd16-e38c9448a1ce">
    <name>СистемаБыстрыхПлатежей</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЧекККМВозврат/Forms/ФормаДокументаРМК/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)	

	Объект.Склад=Объект.ЧекККМ.Склад;
	_ЯвляетсяКассиром = Документы.ЧекККМ.ЯвляетсяКассиром();
	Элементы.ГруппаНижняяКоманднаяПанель.Видимость=_ЯвляетсяКассиром; 
	Элементы._ГруппаНижняяПанельМенеджер.Видимость=не _ЯвляетсяКассиром; 
	КомандыПечати = ПолучитьИзВременногоХранилища(АдресКомандПечатиВоВременномХранилище);
	
	Для Каждого КомандаПечати Из КомандыПечати Цикл
		
		ИмяКнопки = "_"+КомандаПечати.ИмяКоманды;
		
		Если СтрНайти(ИмяКнопки, "КомандаДляВыводаВПустоеПодменю") > 0 Тогда
			Прервать;
		КонецЕсли;
		
		НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяКнопки);
		НоваяКоманда.Действие = "Подключаемый_ОбработатьКомандуПечати";
		НоваяКоманда.Заголовок = КомандаПечати.Заголовок;
		НоваяКоманда.Отображение = ОтображениеКнопки.Текст;
		
		НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы._ПодменюПечать);
		НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
		НоваяКнопка.Высота = 3;
		НоваяКнопка.Ширина = 12;
		
		//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяКнопка, "РастягиватьПоГоризонтали") Тогда
		//	НоваяКнопка.РастягиватьПоГоризонтали = Истина;
		//КонецЕсли;
		
	КонецЦикла;
	если Объект.ОплатаПлатежнымиКартами.Количество()=1 и Объект.ОплатаПлатежнымиКартами.итог("Сумма")=Объект.Товары.Итог("Сумма") тогда
		Элементы.Товары.ТолькоПросмотр        = ложь;
	конецесли;
	если _ЯвляетсяКассиром тогда
		НастроитьПраваДляПользователя(Пользователи.ТекущийПользователь());
	конецесли;
		//Светлакова
	если не значениезаполнено(Объект.Ссылка) тогда
		Объект.Менеджер=Пользователи.ТекущийПользователь();
	конецесли;
	Объект.КассоваяСмена=Объект.ЧекККМ.КассоваяСмена;
	
	Объект.ВидЦены = Объект.ЧекККМ.ВидЦены;
	_ИдТранзакции=АльтерраобщегоНазначения.ПолучитьIDТранзакцииИзРегистра(Объект.ЧекККМ);
			
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ОбщаяСуммаОплатыПлатежнымиКартами = РозничныеПродажиКлиентСервер.СуммаОплатыПлатежнымиКартами(ЭтаФорма.Объект.ОплатаПлатежнымиКартами);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьКомандуПечати(ИмяКоманды, ДополнительныеПараметры) Экспорт
	ОтложитьНаКлиенте(неопределено);
    //имякомандыПоиск=стрзаменить(имякоманды.имя,"_","");
    имякомандыПоиск=Прав(имякоманды.имя, СтрДлина(имякоманды.имя) - 1);

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект,Команды[ИмяКомандыПоиск], Объект);
КонецПроцедуры

&НаКлиенте
Процедура Док__ОтложитьПосле(Команда)
		ДополнительныеПараметры = Новый Структура;
		ОтложитьНаКлиенте(неопределено);
	    //Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Док__РеквизитыПечатиЗаявленияНаВозврат(Команда)
	если не значениезаполнено(Объект.Покупатель) тогда
		Объект.покупатель= строка(Объект.Партнер);
	конецесли;	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Контрагент",                          неопределено);
	СтруктураПараметров.Вставить("Покупатель",                          Объект.Покупатель);
	СтруктураПараметров.Вставить("ДатаРожденияПокупателя",              Объект.ДатаРожденияПокупателя);
	СтруктураПараметров.Вставить("ПричинаВозврата",                     Объект.ПричинаВозврата);
	СтруктураПараметров.Вставить("ВидДокументаПокупателя",              Объект.ВидДокументаПокупателя);
	СтруктураПараметров.Вставить("СерияДокументаПокупателя",            Объект.СерияДокументаПокупателя);
	СтруктураПараметров.Вставить("НомерДокументаПокупателя",            Объект.НомерДокументаПокупателя);
	СтруктураПараметров.Вставить("ДатаВыдачиДокументаПокупателя",       Объект.ДатаВыдачиДокументаПокупателя);
	СтруктураПараметров.Вставить("СрокДействияДокументаПокупателя",     Объект.СрокДействияДокументаПокупателя);
	СтруктураПараметров.Вставить("КемВыданДокументПокупателя",          Объект.КемВыданДокументПокупателя);
	СтруктураПараметров.Вставить("КодПодразделенияДокументаПокупателя", Объект.КодПодразделенияДокументаПокупателя);
	СтруктураПараметров.Вставить("ДатаДокумента",                       Объект.Дата);
	СтруктураПараметров.Вставить("Организация",                         Объект.Организация);
	
	ОткрытьФорму("Обработка.ПечатьЗаявленияНаВозвратТоваровОтКлиента.Форма.РеквизитыПечатиЗаявленияНаВозврат", СтруктураПараметров, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Док_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПечатьЗаявленияНаВозвратТоваровОтКлиента.Форма.РеквизитыПечатиЗаявленияНаВозврат" Тогда
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
&Вместо("ИнформацияОбОплате")
Функция Док_ИнформацияОбОплате(Форма)
	
	// Альтерра Устинов В.А. оплата картой ЧекККМНаВозврат 27.07.2017 14:42:01
	Если Форма.Объект.ОплатаПлатежнымиКартами.Итог("Сумма") > Форма.Объект.Товары.Итог("Сумма") Тогда 
		Если Форма.Объект.ОплатаПлатежнымиКартами.Количество() = 1 Тогда
			Форма.Объект.ОплатаПлатежнымиКартами[0].Сумма= Форма.Объект.Товары.Итог("Сумма");
		КонецЕсли;	
	КонецЕсли;	
	//-
	
	Возврат ПродолжитьВызов(Форма);
	
КонецФункции




&НаКлиенте
Процедура Док_СкопироватьИДПосле(Команда)
	ОбъектКопирования = Новый COMОбъект("htmlfile");
ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text",_ИДТранзакции );
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЧекККМ = ТекущийОбъект.ЧекККМ;
	Если Не Отказ И 
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И
		ЗначениеЗаполнено(ЧекККМ) Тогда
				
		ТЗТовары = ТекущийОбъект.Товары.Выгрузить( , "Номенклатура, Количество");
		ТЗТовары.Свернуть("Номенклатура", "Количество");	
		
		АльтерраОбщегоНазначения.НаличиеЗаказаНаДоставкуПриПолномВозврате(Отказ, ТЗТовары, ТекущийОбъект.Ссылка, ЧекККМ);
	КонецЕсли;
КонецПроцедуры

Функция КассаККМОтличаетсяОтОснования()
	
	ИспользоватьДопПроверку = ДопМодуль.ПолучитьНастройкиХранилища("ВключитьДопПроверкиПоКассовымСменам").ВключитьДополнительныйПроверкиПоКассовымСменам;
	
	Если Не ИспользоватьДопПроверку Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
	     Возврат Ложь;
    КонецЕсли;
	
	КассаККМТекущегоПользователя = РозничныеПродажи.ПолучитьКассуККМТекущегоПользователя();
	
	Если Объект.ЧекККМ.КассаККМ <> КассаККМТекущегоПользователя Тогда
		Сообщить("Текущая касса не соответствует кассе документа! Необходимо перейти на кассу - " + Строка(Объект.ЧекККМ.КассаККМ));
		Возврат Истина;
	Иначе
		Возврат Ложь;
    КонецЕсли;

КонецФункции

&НаКлиенте
Процедура Док_ОплатитьПлатежнойКартойВместо(Команда)
	Если КассаККМОтличаетсяОтОснования() Тогда
	      Возврат;
	Иначе
		  ПродолжитьВызов(Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ОплатитьСмешаннаяОплатаВместо(Команда)
	Если КассаККМОтличаетсяОтОснования() Тогда
	      Возврат;
	Иначе
		  ПродолжитьВызов(Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ОплатитьНаличнымиВместо(Команда)
	Если КассаККМОтличаетсяОтОснования() Тогда
	      Возврат;
	Иначе
		  ПродолжитьВызов(Команда);
	КонецЕсли;
КонецПроцедуры

#Область НапечататьПоследнийСлипЧек

&НаКлиенте
Процедура НапечататьПоследнийСлипЧек(Команда)	
	ДопМодульКлиент.НапечататьПоследнийСлипЧек(ЭтотОбъект.УникальныйИдентификатор, ИдентификаторУстройства(Объект.КассаККМ));
КонецПроцедуры        

&НаСервереБезКонтекста
Функция ИдентификаторУстройства(КассаККМ)
	Возврат Справочники.КассыККМ.ПараметрыКассыККМ(КассаККМ).ИдентификаторУстройства;
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура Док__ОплатаНаМестеПосле(Команда)
	
	ДобавитьОплатуКартойИзЧека();
	ОтложитьНаКлиенте(Неопределено);
	
	ОткрытьФорму("Обработка.БезналичнаяОплатаБезПодключенияОборудования.Форма",Новый Структура("ДокументПродажи",Объект.Ссылка));

КонецПроцедуры

&НаСервере
Процедура ДобавитьОплатуКартойИзЧека()
	СсылкаЧек = Объект.ЧекККМ;
	Если СсылкаЧек.ОплатаПлатежнымиКартами.Количество() > 0 Тогда
		Объект.ОплатаПлатежнымиКартами.Очистить();
		СтрокаОплаты = СсылкаЧек.ОплатаПлатежнымиКартами.Получить(0);
		СтрокаОплатыКартой = Объект.ОплатаПлатежнымиКартами.Добавить();
		СтрокаОплатыКартой.ВидОплаты = СтрокаОплаты.ВидОплаты;
		СтрокаОплатыКартой.ДоговорПодключения = СтрокаОплаты.ДоговорПодключения;
		СтрокаОплатыКартой.ЭквайринговыйТерминал = СтрокаОплаты.ЭквайринговыйТерминал;
		СтрокаОплатыКартой.НомерПлатежнойКарты   = СтрокаОплаты.НомерПлатежнойКарты;
		СтрокаОплатыКартой.Сумма                 = СуммаДокумента;
		СтрокаОплатыКартой.КодАвторизации        = СтрокаОплаты.КодАвторизации;
		СтрокаОплатыКартой.НомерЧекаЭТ           = СтрокаОплаты.НомерЧекаЭТ;
	Иначе
		Сообщить("В чеке продажи не зафиксирована оплата картой");
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
&ИзменениеИКонтроль("ПередЗакрытием")
Процедура Док_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	
	
	РозничныеПродажиКлиент.ОчиститьОкноСообщений(ЭтотОбъект);
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПринудительноеЗавершениеРаботы Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	#Вставка
	если не _ЯвляетсяКассиром тогда
		СтандартнаяОбработка = истина;
		возврат;
	конецесли;
	#КонецВставки
	ПередЗакрытиемЧека(Отказ);
	
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ТоварыПередУдалением")
Процедура Док_ТоварыПередУдалением(Элемент, Отказ)	
	
	#Удаление
	Если ИспользоватьОплатуПлатежнымиКартами Тогда
		Если Объект.ОплатаПлатежнымиКартами.Количество() = 1 
			И ОбщаяСуммаОплатыПлатежнымиКартами > СуммаДокумента - Элементы.Товары.ТекущиеДанные.Сумма Тогда
			ТекстСообщения = НСтр("ru = 'Нельзя удалить эту строку. Сумма оплаты платежными картами станет больше суммы товарных позиций. Операция не поддерживается.'");
			Сообщить(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
    #КонецУдаления
	#Удаление
	Если ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
		Отказ = Истина;
		
		РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
		НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элемент, КэшированныеЗначения, ПараметрыУказанияСерий, Ложь);
		
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		Если ТекущаяСтрока.КоличествоУпаковок <> 0 Тогда
			ТекущаяСтрока.КоличествоУпаковок = 0;
			ТоварыКоличествоУпаковокПриИзменении(Элементы.Товары);
			ПересчитатьДокументНаКлиенте();
		КонецЕсли;		
	Иначе
		РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
		НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элемент, КэшированныеЗначения, ПараметрыУказанияСерий);
		НаборыКлиент.ПередУдалениемСтрокиТабличнойЧасти(ЭтотОбъект, "Товары", Отказ);
		ДополнительныеРеквизиты = Новый Структура("ПередУдалением");
		СобытияФормКлиент.ПриИзмененииЭлемента(ЭтотОбъект, "Товары", ДополнительныеРеквизиты);
	КонецЕсли;
	#КонецУдаления
	#Вставка
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);

	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элемент, КэшированныеЗначения, ПараметрыУказанияСерий);

	НаборыКлиент.ПередУдалениемСтрокиТабличнойЧасти(ЭтотОбъект, "Товары", Отказ);

	ДополнительныеРеквизиты = Новый Структура("ПередУдалением");
	СобытияФормКлиент.ПриИзмененииЭлемента(ЭтотОбъект, "Товары", ДополнительныеРеквизиты);
    #КонецВставки
		
	РозничныеПродажиКлиент.ОчиститьОкноСообщений(ЭтотОбъект);
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("НастроитьРМК")
Процедура Док_НастроитьРМК()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолучитьСсылкиНаОборудование();
	
	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		Элементы.СуммаКВозврату.Ширина                  = 22;
		Элементы.СуммаКВозвратуПлатежнымиКартами.Ширина = 22;
		Элементы.СуммаКВозвратуНаличными.Ширина         = 22;
	КонецЕсли;

	ОбновитьЗаголовкиКнопокФормыНаСервере(Ложь);	
    #Удаление
	РозничныеПродажи.ПодписатьГорячиеКлавишиНаКнопках(ЭтотОбъект);
    #КонецУдаления
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(НастройкиРМК.ГорячиеКлавиши, Неопределено)               КАК ГорячиеКлавиши,
	|	ЕСТЬNULL(НастройкиРМК.ГорячиеКлавиши.БыстрыеТовары, Неопределено) КАК БыстрыеТовары,
	|	ЕСТЬNULL(НастройкиРМК.ГорячиеКлавиши.КомандыФормы, Неопределено)  КАК КомандыФормы,
	|	НастройкиРМК.КассирМожетБытьПродавцом                             КАК КассирМожетБытьПродавцом,
	|	НастройкиРМК.МенеджерТорговогоЗалаМожетБытьПродавцом              КАК МенеджерТорговогоЗалаМожетБытьПродавцом,
	|	НастройкиРМК.ИспользоватьАвторизацию                              КАК ИспользоватьАвторизацию
	|ИЗ
	|	Справочник.НастройкиРМК КАК НастройкиРМК
	|ГДЕ
	|	НастройкиРМК.РабочееМесто = &РабочееМесто
	|	И НастройкиРМК.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Ссылка ИЗ Справочник.НастройкиРМК.КассыККМ КАК Т ГДЕ Т.КассаККМ = &КассаККМ)
	|");
	
	Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.РабочееМестоКлиента());
	Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ГорячиеКлавиши            = Выборка.ГорячиеКлавиши;
		МенеджерТорговогоЗалаМожетБытьПродавцом = Выборка.МенеджерТорговогоЗалаМожетБытьПродавцом;
		КассирМожетБытьПродавцом  = Выборка.КассирМожетБытьПродавцом;
		ПринудительнаяАвторизация = Выборка.ИспользоватьАвторизацию;
		
		Если ЗначениеЗаполнено(ГорячиеКлавиши) Тогда
			РозничныеПродажи.НастроитьБыстрыеТоварыИГорячиеКлавиши(ЭтотОбъект, Выборка);
		КонецЕсли;
		
	Иначе
		
		ГорячиеКлавиши                          = Неопределено;
		ПринудительнаяАвторизация               = Ложь;
		МенеджерТорговогоЗалаМожетБытьПродавцом = Ложь;
		КассирМожетБытьПродавцом                = Истина;
		
	КонецЕсли;
	
	НастроитьПраваДляПользователя(Объект.Кассир);
	
	ПродавецТолькоКассир = КассирМожетБытьПродавцом И Не МенеджерТорговогоЗалаМожетБытьПродавцом;
	Элементы.ТоварыПродавец.Видимость = Не ПродавецТолькоКассир;
	
	Элементы.БыстрыеТовары.Видимость     = ЭтотОбъект.БыстрыеТовары.Количество() > 0;
	
	Элементы.ИзменитьПродавца.Видимость  = Не ПродавецТолькоКассир;
	Элементы.ИзменитьПомещение.Видимость = ПараметрыКассыККМ.ИспользоватьСкладскиеПомещения;
	Элементы.ТоварыПомещение.Видимость   = ПараметрыКассыККМ.ИспользоватьСкладскиеПомещения;
	Элементы.СоставНабора.Видимость      = ПолучитьФункциональнуюОпцию("ИспользоватьНаборы");
	Элементы.УказатьСерии.Видимость      = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	// Установка видимости команды "Получить вес"
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтотОбъект, "");
	
	ДоступныеВидыОплаты = РозничныеПродажиКлиентСервер.ДоступныеВидыОплаты(ЭтотОбъект);
	
	Если Объект.ОплатаПлатежнымиКартами.Количество() > 0 
		И Не (Объект.ОплатаПлатежнымиКартами.Количество() = 1 И ОбщаяСуммаОплатыПлатежнымиКартами < СуммаДокумента) Тогда
		Элементы.Товары.ТолькоПросмотр        = Истина;
		Элементы.ПоискПоШтрихкоду.Доступность = Ложь;
		Элементы.ОткрытьПодбор.Доступность    = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовРМК(ЭтотОбъект, ДоступныеВидыОплаты);
	
	#Удаление
	Элементы.ОплатитьНаличными.Видимость = ДоступныеВидыОплаты.Наличные;
	Элементы.ОплатитьКартой.Видимость    = ДоступныеВидыОплаты.ПлатежныеКарты;
	Элементы.СмешаннаяОплата.Видимость   = ДоступныеВидыОплаты.ПлатежныеКарты;
	
	Элементы.ПоказыватьТолькоВозвращаемыеПозиции.Видимость = Ложь;
	Элементы.ЗаполнитьКоличествоПоЧеку.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
		
 		УстановитьОтборСтрокТаблицыТовары(РежимОтображенияТоваровПоЧеку, Элементы.Товары);
		Элементы.ОткрытьПодбор.Видимость = Ложь;
		Элементы.ПоказыватьТолькоВозвращаемыеПозиции.Видимость = Истина;
		Элементы.ЗаполнитьКоличествоПоЧеку.Видимость = Истина;
		
		Если Не Элементы.Товары.КонтекстноеМеню.ПодчиненныеЭлементы.Найти("ТоварыКонтекстноеМенюДобавить") = Неопределено Тогда
			Элементы.Товары.КонтекстноеМеню.ПодчиненныеЭлементы.ТоварыКонтекстноеМенюДобавить.Видимость = Ложь;
		КонецЕсли;
		Если Не Элементы.Товары.КонтекстноеМеню.ПодчиненныеЭлементы.Найти("ТоварыКонтекстноеМенюСкопировать") = Неопределено Тогда
			Элементы.Товары.КонтекстноеМеню.ПодчиненныеЭлементы.ТоварыКонтекстноеМенюСкопировать.Видимость = Ложь;
		КонецЕсли;
		
		Для Каждого ПодчиненныйЭлементТаблицыТовары Из Элементы.Товары.ПодчиненныеЭлементы Цикл
			Если ПодчиненныйЭлементТаблицыТовары = Элементы.ТоварыКоличествоУпаковок
				Или ПодчиненныйЭлементТаблицыТовары = Элементы.ТоварыУпаковкаЕдиницаИзмерения
				Или ПодчиненныйЭлементТаблицыТовары = Элементы.ТоварыУпаковка Тогда
				Продолжить;
			КонецЕсли;	
			ПодчиненныйЭлементТаблицыТовары.ТолькоПросмотр = Истина;
		КонецЦикла;
		
	Иначе
		РежимОтображенияТоваровПоЧеку = Истина;
	КонецЕсли;
	Элементы.ОтменитьОплатыПлатежнымиКартами.Доступность = (ДанныеПоЧекуККМ.НаименьшаяСуммаНеотмененнойОплатыПлатежнойКартой > 0);
	#КонецУдаления

	#Вставка
		Элементы.ОплатитьНаличными.Видимость = ДоступныеВидыОплаты.Наличные И Объект.ЧекККМ.ФормаОплаты = Перечисления.ФормыОплаты.Наличная;
		Элементы.ОплатитьКартой.Видимость    = ДоступныеВидыОплаты.ПлатежныеКарты И Не (Объект.ЧекККМ.ФормаОплаты = Перечисления.ФормыОплаты.Наличная);
		Элементы.СмешаннаяОплата.Видимость   = ДоступныеВидыОплаты.ПлатежныеКарты И Не (Объект.ЧекККМ.ФормаОплаты = Перечисления.ФормыОплаты.Наличная);
	#КонецВставки
	Элементы.ДекоративноеПолеГруппаСуммаКВозврату1.Видимость = Не Элементы.ОплатитьКартой.Видимость;
	Элементы.ДекоративноеПолеГруппаСуммаКВозврату2.Видимость = Истина;
	Элементы.СуммаКВозвратуПлатежнымиКартами.Видимость = Элементы.ОплатитьКартой.Видимость;
	
	ЭлементыНаПерегруппировку = Новый Массив;
	ЭлементыНаПерегруппировку.Добавить(Элементы.БыстрыеТовары);
	
	Для Каждого Подгруппа Из Элементы.ГруппаНижняяКоманднаяПанельКонтекстныеКоманды.ПодчиненныеЭлементы Цикл
		Для Каждого Элемент Из Подгруппа.ПодчиненныеЭлементы Цикл
			ЭлементыНаПерегруппировку.Добавить(Элемент);
		КонецЦикла;
	КонецЦикла;
	
	ЭлементыНаПерегруппировку.Добавить(Элементы.ОплатитьНаличными);
	ЭлементыНаПерегруппировку.Добавить(Элементы.ОплатитьКартой);
	ЭлементыНаПерегруппировку.Добавить(Элементы.СмешаннаяОплата);
	
	НастроитьРМКЛокализация(ДоступныеВидыОплаты, ЭлементыНаПерегруппировку);
	
	РозничныеПродажи.ПерегруппироватьКнопкиФормы(ЭтотОбъект, ЭлементыНаПерегруппировку);
	
	РозничныеПродажи.НастроитьКомандыПечати(ЭтотОбъект, Элементы.ПеремещаемыеКнопки);
	
КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//&ИзменениеИКонтроль("ИнформацияОбОплате")
//Функция Док_ИнформацияОбОплате1(Форма)
//	#Вставка
//	// Альтерра Устинов В.А. оплата картой ЧекККМНаВозврат 27.07.2017 14:42:01
//	Если Форма.Объект.ОплатаПлатежнымиКартами.Итог("Сумма") > Форма.Объект.Товары.Итог("Сумма") Тогда 
//		Если Форма.Объект.ОплатаПлатежнымиКартами.Количество() = 1 Тогда
//			Форма.Объект.ОплатаПлатежнымиКартами[0].Сумма= Форма.Объект.Товары.Итог("Сумма");
//		КонецЕсли;	
//	КонецЕсли;	
//	//-

//	#КонецВставки
//	ОплатаПлатежнымиКартамиОтменено = 0;
//	Форма.ОбщаяСуммаОплатыПлатежнымиКартами = 0;

//	ОплатыПлатежнымиКартами = ОплатыПлатежнымиКартами(Форма.Объект.ОплатаПлатежнымиКартами);
//	Для Каждого СтрокаТЧ Из ОплатыПлатежнымиКартами Цикл
//		Форма.ОбщаяСуммаОплатыПлатежнымиКартами = Форма.ОбщаяСуммаОплатыПлатежнымиКартами + СтрокаТЧ.Сумма;

//		Если СтрокаТЧ.ОплатаОтменена Тогда
//			ОплатаПлатежнымиКартамиОтменено = ОплатаПлатежнымиКартамиОтменено + СтрокаТЧ.Сумма;
//		КонецЕсли;
//	КонецЦикла;
//	
//	
//	Форма.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Форма.Объект.Товары, Форма.Объект.ЦенаВключаетНДС);

//	Если Форма.Объект.ЦенаВключаетНДС Тогда
//		СуммаБезСкидки = Форма.СуммаДокумента;
//	Иначе
//		СуммаБезСкидки = Форма.СуммаДокумента - Форма.Объект.Товары.Итог("СуммаНДС");
//	КонецЕсли;

//	ИнформацияОбОплате = Новый Структура;
//	ИнформацияОбОплате.Вставить("Документ",               Форма.Объект.Ссылка);

//	ИнформацияОбОплате.Вставить("Наличные",               Форма.Объект.ВыданоНаличными);
//	ИнформацияОбОплате.Вставить("ПлатежныеКарты",         Форма.ОбщаяСуммаОплатыПлатежнымиКартами);

//	ИнформацияОбОплате.Вставить("ПлатежныеКартыОтменено", ОплатаПлатежнымиКартамиОтменено);
//	ИнформацияОбОплате.Вставить("ПодарочныеСертификаты",  0);
//	ИнформацияОбОплате.Вставить("БонусныеБаллы",          0);

//	ИнформацияОбОплате.Вставить("СуммаДокумента",        Форма.СуммаДокумента);
//	ИнформацияОбОплате.Вставить("СуммаКОплате",          СуммаБезСкидки);
//	ИнформацияОбОплате.Вставить("СуммаСкидки",           0);

//	ИнформацияОбОплате.Вставить("ДоступныеВидыОплаты",   ДоступныеВидыОплаты(Форма));

//	ИнформацияОбОплате.Вставить("ИтогоОплачено", ИнформацияОбОплате.Наличные + ОплатаПлатежнымиКартамиОтменено);

//	ИнформацияОбОплатеЛокализация(Форма, ИнформацияОбОплате);

//	Возврат ИнформацияОбОплате;

//КонецФункции


&НаСервере
&ИзменениеИКонтроль("НастроитьРМКЛокализация")
Процедура Док_НастроитьРМКЛокализация(ДоступныеВидыОплаты, ЭлементыНаПерегруппировку)

	//++ Локализация 
	#Удаление
	Элементы.ОплатитьСБП.Видимость       = ДоступныеВидыОплаты.СБП И ОбщаяСуммаОплатыСБП > 0
	ИЛИ ДоступныеВидыОплаты.СБП И Не ЗначениеЗаполнено(Объект.ЧекККМ);
    #КонецУдаления
	#Вставка
	Элементы.ОплатитьСБП.Видимость = Ложь; 
	Элементы.ОплатитьНаличными.Видимость = Элементы.ОплатитьНаличными.Видимость И ОбщаяСуммаОплатыЭСФСС = 0 и ОбщаяСуммаОплатыСБП = 0;
	#КонецВставки
	Элементы.ОплатитьНаличными.Видимость = Элементы.ОплатитьНаличными.Видимость И ОбщаяСуммаОплатыЭСФСС = 0
	ИЛИ Элементы.ОплатитьСБП.Видимость;

	Элементы.ОплатитьКартой.Видимость    = Элементы.ОплатитьКартой.Видимость И ОбщаяСуммаОплатыЭСФСС = 0;
	Элементы.ОплатитьСБП.Видимость       = Элементы.ОплатитьСБП.Видимость И ОбщаяСуммаОплатыЭСФСС = 0; 
	#Удаление
	Элементы.СмешаннаяОплата.Видимость   = Элементы.СмешаннаяОплата.Видимость
											ИЛИ (Элементы.ОплатитьСБП.Видимость И ОбщаяСуммаОплатыЭСФСС = 0 И СуммаДокумента <> ОбщаяСуммаОплатыСБП); 
	#КонецУдаления
	#Вставка
	Элементы.СмешаннаяОплата.Видимость       = Элементы.СмешаннаяОплата.Видимость ИЛИ (ДоступныеВидыОплаты.СБП И ОбщаяСуммаОплатыСБП > 0);
	#КонецВставки
   	Элементы.ОплатитьЭСФСС.Видимость = ДоступныеВидыОплаты.ЭСФСС И ОбщаяСуммаОплатыЭСФСС > 0;
	ЭлементыНаПерегруппировку.Добавить(Элементы.ОплатитьЭСФСС);

	ЭлементыНаПерегруппировку.Добавить(Элементы.ОплатитьСБП);

	Элементы.ДекоративноеПолеГруппаСуммаКВозврату2.Видимость = Не Элементы.ОплатитьСБП.Видимость;
	Элементы.СуммаКВозвратуСБП.Видимость = Элементы.ОплатитьСБП.Видимость;
	#Вставка
	//Проверить работоспособность СБП при обновлении, заглушка типовой кнопки
	//Элементы.СмешаннаяОплата.Видимость       = ДоступныеВидыОплаты.СБП И ОбщаяСуммаОплатыСБП > 0;

	
	Элементы.СуммаКВозвратуСБП.Видимость = ДоступныеВидыОплаты.СБП И ОбщаяСуммаОплатыСБП > 0;
	#КонецВставки
	//-- Локализация

КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ОткрытьФормуСмешаннойОплаты")
Процедура Док_ОткрытьФормуСмешаннойОплаты(ИзмененныеДанныеЗаписаны, ДополнительныеПараметры)

	Если Не ИзмененныеДанныеЗаписаны Тогда
		РозничныеПродажиКлиент.РазблокироватьФорму(Этотобъект);
		Возврат;
	КонецЕсли;

	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ИнформацияОбОплате",     ИнформацияОбОплате(ЭтотОбъект));
	ПараметрыОткрытияФормы.Вставить("Партнер",                Объект.Партнер);
	ПараметрыОткрытияФормы.Вставить("ДоступнаПередачаДанных", ПараметрыКассыККМ.ДоступнаПередачаДанных);
	#Удаление
	ПараметрыОткрытияФормы.Вставить("ЭтоПолныйВозвратВСменуПродажи", ЭтоПолныйВозвратВСменуПродажи);
	#КонецУдаления
	#Вставка
	Если ЗначениеЗаполнено(_ИДТранзакции) и _ИДТранзакции <> "Не найден лог" и _ИДТранзакции <> "ID not found" Тогда
		ПараметрыОткрытияФормы.Вставить("Идентификатор", _ИДТранзакции);
	КонецЕсли;
    #КонецВставки
	ПараметрыОткрытияФормы.Вставить("СтатусОплатыСБПЧекаПродажи", СтатусОплатыСБПЧекаПродажи);

	ОткрытьФорму(
	"Документ.ЧекККМ.Форма.ФормаСмешаннойОплаты",
	ПараметрыОткрытияФормы,
	ЭтотОбъект,,,,
	Новый ОписаниеОповещения("ЗавершениеОплаты", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура Док_ОбработатьРезультатОплатыСБП(РезультатВыполнения, ДополнительныеПараметры) Экспорт
			
	Док_ОбработатьРезультатОплатыСБПСервер(РезультатВыполнения);	
	
КонецПроцедуры

&НаСервере
Процедура Док_ОбработатьРезультатОплатыСБПСервер(РезультатВыполнения)
			
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ИнтеграцияСБПГазпромбанк.ОбработатьОплатуВЧекККМНаВозврат(РезультатВыполнения, ДокОбъект);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");  
	
 КонецПроцедуры

&НаКлиенте
Процедура Док_ОбновитьФормуСБП(Результат, ДополнительныеПараметры) Экспорт
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("УстановитьДоступностьЭлементовРМКЛокализация")
Процедура Док_УстановитьДоступностьЭлементовРМКЛокализация(Форма, ДоступныеВидыОплаты)

	//++ Локализация
	#Удаление
	ЕстьВозвращаемыеПозиции = (Форма.Объект.Товары.Количество() > 0);
	Форма.Элементы.ОплатитьЭСФСС.Доступность = ЕстьВозвращаемыеПозиции;

	#КонецУдаления
	#Вставка
	Форма.Элементы.ОплатитьЭСФСС.Доступность = Истина;
    #КонецВставки
	Если ДоступныеВидыОплаты.ЭСФСС Тогда
		ОплатыЭСФСС = ОплатыЭСФСС(Форма.Объект.ОплатаПлатежнымиКартами);
		Если (ОплатыЭСФСС.Количество() > 0 И ОплатыЭСФСС[0].ОплатаОтменена = Истина)
			Или Форма.ОбщаяСуммаОплатыЭСФСС > Форма.СуммаДокумента Тогда
			Форма.Элементы.ОплатитьЭСФСС.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если Форма.СтатусОплатыСБПЧекаПродажи = ПредопределенноеЗначение("Перечисление.ТипыСтатусовОплатыСБП.ОжидаетПодтверждение") Тогда
		Форма.Элементы.ОплатитьСБП.Видимость = Ложь;
		Форма.ИспользоватьОплатуСБП = Ложь;
	Иначе
    #Удаление
		Форма.Элементы.ОплатитьСБП.Доступность = ЕстьВозвращаемыеПозиции;
		Форма.Элементы.ОплатитьСБП.Видимость = (ДоступныеВидыОплаты.СБП И Форма.ОбщаяСуммаОплатыСБП > 0)
													ИЛИ ДоступныеВидыОплаты.СБП И НЕ ЗначениеЗаполнено(Форма.Объект.ЧекККМ);
	#КонецУдаления
	КонецЕсли;
	
	#Удаление
	Если Форма.ОбщаяСуммаОплатыЭСФСС > 0
		ИЛИ Форма.СтатусОплатыСБПЧекаПродажи = ПредопределенноеЗначение("Перечисление.ТипыСтатусовОплатыСБП.ОжидаетПодтверждение") Тогда
		Форма.Элементы.Товары.ТолькоПросмотр = Истина;
	КонецЕсли;
	#КонецУдаления
	
	//-- Локализация

КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.ЧекККМ) Тогда 
		Отказ = Не Документы.ЧекККМВозврат.МожноСоздатьЧекВозврат(Объект.ЧекККМ);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьДанныеНеотмененныхОплатПлатежнымиКартамиПоЧекуККМ")
Процедура Док_ЗаполнитьДанныеНеотмененныхОплатПлатежнымиКартамиПоЧекуККМ()

	ДанныеПоЧекуККМ.Вставить("КомбинацииСуммНеотмененныхОплатПлатежнымиКартами", Новый Массив);
	ДанныеПоЧекуККМ.Вставить("НаименьшаяСуммаНеотмененнойОплатыПлатежнойКартой", 0);
	ДанныеПоЧекуККМ.Вставить("КоличествоНеотмененныхОплатПлатежнымиКартами", 0);
	ДанныеПоЧекуККМ.Вставить("ДанныеПервойНеотмененнойОплатыПлатежнымиКартами", Неопределено);
	ДанныеПоЧекуККМ.Вставить("НомераСтрокОтменяемыхОплатПлатежнойКартой", Новый Соответствие);

	Если ЗначениеЗаполнено(Объект.ЧекККМ) Тогда

		МассивВидовОплат = Новый Массив;
		МассивВидовОплат.Добавить(Перечисления.ТипыПлатежнойСистемыККТ.ПлатежнаяКарта);
		
		#Удаление
		Запрос = Новый Запрос(Документы.ЧекККМ.ТекстЗапросаДляПолученияНеотмененныхОплатПоЧекуККМ(Истина, Ложь));
		#КонецУдаления
		#Вставка
		//Запрос изменен, чтобы была возможность сделать несколько отмен по одному чеку
        Запрос = Новый Запрос (ИзмененныйТекстЗапросаДляПолученияНеотмененныхОплатПоЧекуККМ());
        #КонецВставки
		Запрос.УстановитьПараметр("Ссылка", Объект.ЧекККМ);
		Запрос.УстановитьПараметр("ВидыОплат", МассивВидовОплат);

		ТаблицаНеотмененныхОплатПлатежнымиКартами = Запрос.Выполнить().Выгрузить();

		// Проверка, что настроены эквайринговые терминалы, использованные при оплате по чеку продажи.
		НастроенныеЭквайринговыеТерминалы = Новый Соответствие;
		Для Каждого Терминал Из ЭквайринговыеТерминалы Цикл
			ТерминалЗначение = Терминал.Значение; // Структура
			НастроенныеЭквайринговыеТерминалы.Вставить(ТерминалЗначение.Ссылка, Терминал.Значение);
		КонецЦикла;
		МассивСтрокДляУдаления = Новый Массив;
		Для Каждого НеотмененнаяОплатаПлатежнойКартой Из ТаблицаНеотмененныхОплатПлатежнымиКартами Цикл
			#Удаление
			Если НеотмененнаяОплатаПлатежнойКартой.Сумма > Объект.СуммаДокумента 
				Или НастроенныеЭквайринговыеТерминалы[НеотмененнаяОплатаПлатежнойКартой.ЭквайринговыйТерминал] = Неопределено Тогда
			#КонецУдаления
			#Вставка
			Если НастроенныеЭквайринговыеТерминалы[НеотмененнаяОплатаПлатежнойКартой.ЭквайринговыйТерминал] = Неопределено Тогда
			#КонецВставки
				МассивСтрокДляУдаления.Добавить(НеотмененнаяОплатаПлатежнойКартой);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
			ТаблицаНеотмененныхОплатПлатежнымиКартами.Удалить(СтрокаДляУдаления);
		КонецЦикла;

		ТаблицаНеотмененныхОплатПлатежнымиКартами.Колонки.Добавить("НомерСтроки");
		НомерСтрокиНеотмененнойОплаты = 0;
		Для Каждого СтрокаНеотмененныхОплат Из ТаблицаНеотмененныхОплатПлатежнымиКартами Цикл
			СтрокаНеотмененныхОплат.НомерСтроки = НомерСтрокиНеотмененнойОплаты;
			НомерСтрокиНеотмененнойОплаты = НомерСтрокиНеотмененнойОплаты + 1;
		КонецЦикла;

		ДанныеПоЧекуККМ.АдресТаблицыНеотмененныхОплатПлатежнымиКартами = ПоместитьВоВременноеХранилище(ТаблицаНеотмененныхОплатПлатежнымиКартами, УникальныйИдентификатор);

		РезультатПересчета = РозничныеПродажиВызовСервера.ПересчитатьДанныеНеотмененныхОплатПлатежнымиКартами(ДанныеПоЧекуККМ.АдресТаблицыНеотмененныхОплатПлатежнымиКартами);
		ДанныеПоЧекуККМ.ДанныеПервойНеотмененнойОплатыПлатежнымиКартами = РезультатПересчета.ДанныеПервойНеотмененнойОплатыПлатежнымиКартами;
		ДанныеПоЧекуККМ.КоличествоНеотмененныхОплатПлатежнымиКартами = РезультатПересчета.КоличествоНеотмененныхОплатПлатежнымиКартами;
		ДанныеПоЧекуККМ.КомбинацииСуммНеотмененныхОплатПлатежнымиКартами = РезультатПересчета.КомбинацииСуммНеотмененныхОплатПлатежнымиКартами;
		ДанныеПоЧекуККМ.НаименьшаяСуммаНеотмененнойОплатыПлатежнойКартой = РезультатПересчета.НаименьшаяСуммаНеотмененнойОплатыПлатежнойКартой;
		#Вставка
		Если ДанныеПоЧекуККМ.ДанныеПервойНеотмененнойОплатыПлатежнымиКартами = Неопределено И Объект.ЧекККМ.ФормаОплаты = Перечисления.ТипыПлатежнойСистемыККТ.ПлатежнаяКарта Тогда
			АльтерраОбщегоНазначения.СообщитьПользователю(Объект.ЧекККМ, "Отмена оплаты платежными картами по " + Объект.ЧекККМ + " недоступна."); 
		КонецЕсли;
		#КонецВставки	
	КонецЕсли;

КонецПроцедуры

//Измененный текст запроса позволяет получить данные о строчках безналичной оплаты из чека-основания
//даже если эти строчки уже были частично отменены. 
Функция ИзмененныйТекстЗапросаДляПолученияНеотмененныхОплатПоЧекуККМ()
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатыПлатежнымиКартами.ВидОплаты КАК ВидОплаты,
	|	ОплатыПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ОплатыПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
	|	ОплатыПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|	СУММА(ОплатыПлатежнымиКартами.Сумма) КАК Сумма,
	|	ОплатыПлатежнымиКартами.ОплатаОтменена КАК ОплатаОтменена
	|ПОМЕСТИТЬ ВозвратОплатыПлатежнымиКартамиПоЧеку
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ОплатыПлатежнымиКартами
	|		ПО (ОплатыПлатежнымиКартами.Ссылка = ЧекККМВозврат.Ссылка)
	|ГДЕ
	|	ЧекККМВозврат.ЧекККМ = &Ссылка
	|	И ЧекККМВозврат.Проведен
	|	И ЧекККМВозврат.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ОплатыПлатежнымиКартами.ВидОплаты В(&ВидыОплат)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыПлатежнымиКартами.ВидОплаты,
	|	ОплатыПлатежнымиКартами.ЭквайринговыйТерминал,
	|	ОплатыПлатежнымиКартами.КодАвторизации,
	|	ОплатыПлатежнымиКартами.НомерПлатежнойКарты,
	|	ОплатыПлатежнымиКартами.ОплатаОтменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатыПлатежнымиКартами.ВидОплаты КАК ВидОплаты,
	|	ОплатыПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ОплатыПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
	|	ОплатыПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|	ОплатыПлатежнымиКартами.Сумма - ЕСТЬNULL(ВозвратОплатыПлатежнымиКартамиПоЧеку.Сумма, 0) КАК Сумма,
	|	ОплатыПлатежнымиКартами.ИдентификаторКорзины КАК ИдентификаторКорзины,
	|	ОплатыПлатежнымиКартами.СсылочныйНомер КАК СсылочныйНомер,
	|	ОплатыПлатежнымиКартами.ДоговорПодключения КАК ДоговорПодключения,
	|	ОплатыПлатежнымиКартами.ИдентификаторПлатежнойСистемы КАК ИдентификаторПлатежнойСистемы,
	|	ОплатыПлатежнымиКартами.НомерЧекаЭТ КАК НомерЧекаЭТ
	|ИЗ
	|	Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ОплатыПлатежнымиКартами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВозвратОплатыПлатежнымиКартамиПоЧеку КАК ВозвратОплатыПлатежнымиКартамиПоЧеку
	|		ПО (ВозвратОплатыПлатежнымиКартамиПоЧеку.ВидОплаты = ОплатыПлатежнымиКартами.ВидОплаты)
	|			И (ВозвратОплатыПлатежнымиКартамиПоЧеку.ЭквайринговыйТерминал = ОплатыПлатежнымиКартами.ЭквайринговыйТерминал)
	|			И (ВозвратОплатыПлатежнымиКартамиПоЧеку.КодАвторизации = ОплатыПлатежнымиКартами.КодАвторизации)
	|			И (ВозвратОплатыПлатежнымиКартамиПоЧеку.НомерПлатежнойКарты = ОплатыПлатежнымиКартами.НомерПлатежнойКарты)
	|			И (ВозвратОплатыПлатежнымиКартамиПоЧеку.ОплатаОтменена = ИСТИНА)
	|ГДЕ
	|	ОплатыПлатежнымиКартами.Ссылка = &Ссылка
	|	И ОплатыПлатежнымиКартами.ВидОплаты В(&ВидыОплат)
	|	И ОплатыПлатежнымиКартами.Сумма - ЕСТЬNULL(ВозвратОплатыПлатежнымиКартамиПоЧеку.Сумма, 0) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидОплаты,
	|	ЭквайринговыйТерминал,
	|	НомерПлатежнойКарты,
	|	КодАвторизации,
	|	ИдентификаторКорзины,
	|	ДоговорПодключения,
	|	НомерЧекаЭТ";
	Возврат ТекстЗапроса;
КонецФункции
